{"title":"Our work and mission","image":"/images/centre_enter-cropped.jpeg","staff":[{"name":"Rick Hutchins","id":"vi5obujaz","position":"Executive Director","email":"acf@nb.aibn.com","photo":"/images/rick.jpg"},{"id":"gg8jx8znl","photo":"/images/uploads/mekana.jpg","name":"Makenna O'Dell","position":"Special Events and Fundamental Development Coordinator","email":"makenna.odell@unb.ca"}],"executives":[],"members":[],"blocks":[{"_template":"ContentBlock","content":"<h4>About us</h4><p>Autism Connections Fredericton (ACF) is a locally based non-profit organization committed to helping individuals with Autism Spectrum Disorders (ASD), their family, friends, and professionals working with them in the Fredericton area. We provide free access to referrals, resources, support, education, and outreach services to our members and the public.</p><p>We have a lending library for members with ASD related books and videos on topics such as Asperger’s Syndrome, Sensory Processing Issues, Communication, and Social Skills Training. Our lending library also includes toys and games as well as educational software and materials.</p>","center":false,"label":"About us","margin":{"mb":"6"}},{"createdOn":"Thu Jun 18 2020 17:18:04 GMT-0300 (Atlantic Daylight Time)","label":"Mission Statement","content":"<h4>Mission Statement</h4><p>Autism Connections Fredericton Inc. (ACF) is a registered charity dedicated to providing social supports, public education, advocacy, material resources, programs, activities, and evidenced-based information for persons with an autism spectrum disorder, their families, and their communities. ACF serves the greater Fredericton region.</p><ul><li><p>We offer on-site resources include a lending library for information, books, toys, and other educational resource materials.</p></li><li><p>A One-On-One Tutoring Program for Students with ASD</p></li><li><p>Social support is provided through special events and activities such as Chat 'N' Chill (autistic adult hang out), a Parent Support Group, Halloween party, Christmas party, and more.</p></li><li><p>Recreational programs such as Camp Marvel, Tumbling, Tae Kwon Do, and art classes (COVID-19-dependent).</p></li><li><p>ACF hosts educational evenings where members can learn about topics relevant to them such as the disability tax credit, therapeutic horseback riding and presentations from other organizations on the services that they offer. ACF also sets up information booths and delivers presentations around our community.</p></li><li><p>A meeting area which could accommodate up to 40 persons for workshops and seminars (COVID-19-dependent).</p></li></ul>","center":false,"margin":{"mb":"6"},"_template":"ContentBlock"},{"createdOn":"Thu Jun 18 2020 17:18:04 GMT-0300 (Atlantic Daylight Time)","label":"We Are You","content":"<h4>We Are You</h4><p>Autism Connections Fredericton is not only our staff and board of directors, it is all the community members who support us daily by <a href=\"/fundraising-volunteer#volunteer\">volunteering at our center and events</a>, it is all the people who provide us with <a href=\"/donations\">material support</a> and kind-hearted persons helping us to reach out to more people who need our help the most.</p><p>Thanks to your involvement we are not only helping hundreds of people with autism spectrum disorders, but also significantly raising awareness of the community on ASD and educating the public on the many ways of dealing with it correctly.</p>","center":false,"margin":{"mb":"4"},"_template":"ContentBlock"},{"createdOn":"Wed Jan 06 2021 22:37:31 GMT-0400 (Atlantic Standard Time)","label":"","title":"Board of Directors","size":"Header 4","center":false,"margin":{"mb":"4","mt":"6"},"_template":"TitleBlock","subtitle":""},{"createdOn":"Wed Jan 06 2021 22:37:31 GMT-0400 (Atlantic Standard Time)","label":"","content":"<h5>Chair: Paul McDonnell</h5><p>Paul M. McDonnell, Ph.D. Paul was a professor in Psychology at the University of New Brunswick for 30 years and since has worked as a clinical child psychologist in private practice until his retirement in 2018. He is currently a Professor Emeritus at UNB and a Fellow of the Canadian Psychological Association. He was a consultant for the UNB Autism Intervention Training Program since its inception in 2004.&nbsp;</p><h5>Vice Chair: Kim MacKeigan</h5><p>Kim MacKeigan&nbsp;has been a licensed speech-language pathologist (S-LP) in the province of New Brunswick for 27 years. For the past 16 years, she has worked as a consulting S-LP at the Stan Cassidy Centre for Rehabilitation, working exclusively with children and youth diagnosed with Autism Spectrum Disorder for most of that time. From 2003 to 2009, Kim was an instructor with the University of New Brunswick College of Extended Learning’s Autism Intervention Training program and from 2014 to 2016 served as a member of a curriculum advisory committee for the Department of Education and Early Childhood Development’s Autism Training program. She has served on ACF’s board for over 10 years.&nbsp;</p><h5>Secretary: Elizabeth McDonnell</h5><p>Elizabeth McDonnell<strong>&nbsp;</strong>is a retired paediatric occupational therapist who spearheaded the development of an Autism Team at the Stan Cassidy Centre for Rehabilitation in the early 1990’s. She has been a long-time volunteer with the Canadian Rehabilitation Council for the Disabled, the Fredericton Therapeutic Riding Association, and on the board of Team Canada Healing Hands with whom she participated in a dozen international health care missions. She has served on ACF’s board since 2010.&nbsp;</p><h5>Samantha Landry</h5><p>Samantha Landry<strong>&nbsp;</strong>has been with the center since summer 2017 first as a volunteer, then as summer staff, and now as a board member. Samantha is a social worker in the community who is passionate about assuring community services for individuals and families on the Autism spectrum.&nbsp;</p><h5>Judy L.McKinney</h5><p>Judy L. McKinney, BSW, RSW, is a registered social worker/counsellor in part-time private practice, and a part-time job coach/ co-worker with an autistic adult. She also worked 18 years in a not for profit counselling agency. Alongside her autistic adult daughter, Judy seeks to learn and share awareness and advocacy for autistic people. Judy joined as a parent board member in 2014.&nbsp;</p><h5>Barbara D'Entremont</h5><p>Barbara D’Entremont, a licensed psychologist with over 20 years’ experience. A full professor in the Psychology Department at UNB, D’Entremont teaches courses on child development and clinical psychology at both the undergraduate and graduate level. Her research and clinical specialty is autism spectrum disorder. She also maintains a small private practice. She has been on the board for 6 years.</p><h5>Michel Elliott</h5><p>Michael Elliott, 39, raised in Newfoundland &amp; Labrador, with commitment to its long-standing heritage. A dedicated member to our Canadian Armed Forces and its citizens within. Most importantly, a proud father to a young, baronial boy impacted by ASD.&nbsp;</p><h5>Monique Lavigne</h5><p>Monique Lavigne<strong>&nbsp;</strong>is an Educational Assistant working in the Francophone School District. She is also the founder of No Limits Soccer, a program that runs every summer and that she created specifically for kids on the spectrum. Monique has two children, one of which is autistic. She is dedicated to creating awareness and acceptance, as well as opportunities for the autistic population.&nbsp;</p><h5>Amberee Hardy</h5><p>Amberee Hardy&nbsp;has been on the board of ACF since early winter of 2020. She has held various positions in Atlantic Superstore from, finance team including franchisees &amp; franchisor accounting, to Human resources partner – LGBTQ2S+ Ambassador. She is LGBTQ2S+ community spokesperson, coordinator for three communities. Amberee had developed and facilitated programming for young individuals in the past three years. Amberee was medically diagnosed with autism later in life. She has two identities, Autistic/transgender. She is working hard to make life better for all Autistic people through her writing, throughout consultancy, and training and supporting Autistic people both online and offline by mentoring. With her experience on different boards and LGBTQ2S+ organizations she can offer great advice. Currently Amberee has received her certificate for fundamentals for a career in Human resources along with her certificate in Master Strategic thinking and problem-solving skills from Loblaws.&nbsp;</p><h5>Greg Forsythe</h5><p>Greg Forsythe, BT, BEd, and Med was a teacher in New Brunswick for 32 years mostly at the primary level. He had several students in his classes in grade two on the Autism Spectrum. Forsythe is politically active, engages in many fundraisers, and is a choir director.&nbsp;</p><h5>Katie LaCosta</h5><p>Katie LaCosta&nbsp;is a teacher in Anglophone School District West and mother to two children, one of whom has autism. She is proud to be involved in Autism Connections Fredericton, helping to run programming like the One-on-One Tutoring Program for Autistic Students, as well as the Parent Support Group. She is furthering her education in teaching students with exceptionalities like ASD and she advocates for awareness and acceptance of the autistic community.</p><h5>Ginette Hannan</h5><p>Ginette Hannan<strong>&nbsp;</strong>has spent most of her working life with various levels of government as an Admin. She is recently retired but will be launching a photography business as soon as she is allowed to do so after the pandemic is over. Hannan has become involved with the Board because she has an adult son and a 12-year-old grandson on the spectrum. She wants to help pave a better future for them and other families. When her son was diagnosed back in the late 80s, very little was known about Autism, and there was no support that I knew of. There are many more resources today, but there is still a lot of work to do. Hannan is proud to be associated with Autism Connections Fredericton and to help raise awareness and provide services.&nbsp;</p>","center":false,"margin":{"mb":"4"},"_template":"ContentBlock"}],"pageTitle":"Our work and mission","content":{"enabled":true}}